---
kind: property
id: P:Autodesk.Revit.DB.PrintParameters.PaperSize
source: html/7a3778e5-6a20-2ac7-0986-60effa282194.htm
---
# Autodesk.Revit.DB.PrintParameters.PaperSize Property

The page size.

## Syntax (C#)
```csharp
public PaperSize PaperSize { get; set; }
```

## Remarks
User can select the candidate via PaperSizes and then
set the Page source of the Print Setting.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when the input argument is Nothing nullptr a null reference ( Nothing in Visual Basic) .
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when the input argument is invalid for current printer.